[
    {
        "Rating": 5,
        "Comment": "I love it the color is just the same good product and shipping is right and true",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 5,
        "Comment": "Just got my shirt in the mail, it came on time and I didn't have to wait any extra days. I brought the shirt in and took it out of the bag and tried it on. keep in mind I am almost 400 lb s and I bought a 6xl just for kicks , I only bought one because you never know but anyway I tried it on and it fits with plenty of room. it also comes longer than the average shirt so it stops around your pocket. and the fabric was great, it has just a little give but won't stretch out of shape. great buy for less than $8. going to stock up.",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 4,
        "Comment": "Very stiff material, didn't want to attempt to stretch as I felt like the material would rip. Ordered in a 5xl as I like my shirts super baggy but these did not work. They were loose in the mid section and sleeves but the bottom hugged which is what didn't want to give to be stretched. The sleeves came a lil over half way down my arm tho so I ended up returning and found something else",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 4,
        "Comment": "5 stars for color. 1 star for fit! I needed this exact color of shirt to go with my favorite pants. I bought 8 maroon shirts everywhere online hoping for a match. But this Hanes was the ONLY correct color. However, Hanes didn't HAVE it in women's or in smaller men's sizes. Lucky me! I can sew! So I bought the remaining XXXXLg men's size, and easily cut out a perfect shirt for myself. Great match! What do you think? Yes, I'm old- 76! Girls in my generation ALL knew how to sew!",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 4,
        "Comment": "I like the T-shirts but they fit tight across the shoulders and chest",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 4,
        "Comment": "The fatigue green color is really nice. Love the color. It also feels a bit different than the other colors. I would say maybe stiffer, able to hold shape more, almost feeling thicker. It also runs a tiny bit smaller than the blue and black shirts I’ve purchased.",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 4,
        "Comment": "Bought as a Christmas gift for my brother who really liked the color of grey and the t-shirt. He had no complaints. The price was really fair too.",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 4,
        "Comment": "Nice looking Tee for casual wear. At this time of year I favor the tank but it's over 100 here. In the fall this will be more comfortable. Looks nice came out of the drier needing a good shake.",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 3,
        "Comment": "Great fit, Really great low price, But the quality is not as good as they were a few years ago, when we ordered them. The bottom of shirt line after laundering, stretches out every which way, and is visibly unsightly. The material is not as soft as it was previously either.",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 3,
        "Comment": "I don't care for the t-shirts. They are tapered at the waist, which I don't like. I even bought a size larger than I normally wear, and they don't fit very well. The fabric is heavy, not like lightweight, and even after washing, it doesn't seem to move with you.",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    },
    {
        "Rating": 5,
        "Comment": "Nice and roomy,I got the men's shirts, sleep in them,it's big on me I wear a 3x in womens,but I got them bigger then I should have but they wash and dry up really nice. I wear F.Y.I with my pm bottoms,probably out two people in the shirt,but I like all the extra room! I have MS and sometimes it hurts for me to wear clothes,that's one reason why I get them so big",
        "Item": "Hanes Men's and Big Men's Authentic Short Sleeve Tee",
        "User": "Joe Williams"
    }
]